In [1]:
# datastructure in pandas
# 1. series data structure
# 2. dataframe data structure

In [11]:
 # Series data structure
import pandas as pd
import numpy as np

In [7]:
# using dictionary
a = pd.Series({'a':10,'b':20,'c':30,'d':40})
print(a)

a    10
b    20
c    30
d    40
dtype: int64

In [8]:
type(a)

pandas.core.series.Series

In [10]:
b = pd.Series([10,20,30,40], index=['a','b','c','d'])
print(b)

a    10
b    20
c    30
d    40
dtype: int64

In [13]:
pd.Series(np.arange(10, 50))

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
20    30
21    31
22    32
23    33
24    34
25    35
26    36
27    37
28    38
29    39
30    40
31    41
32    42
33    43
34    44
35    45
36    46
37    47
38    48
39    49
dtype: int64

In [14]:
# creating dataframe

In [15]:
# using dictionary

df = pd.DataFrame({
    'name' : ['ram', 'shyam', 'hari', 'gita'],
    'age' : [23, 25, 22, 24],
})

In [16]:
df

    name  age
0    ram   23
1  shyam   25
2   hari   22
3   gita   24

In [46]:
df1 = pd.DataFrame(np.arange(1, 51).reshape(10,5), columns=['col1', 'col2', 'col3', 'col4', 'col5'])
print(df1)

   col1  col2  col3  col4  col5
0     1     2     3     4     5
1     6     7     8     9    10
2    11    12    13    14    15
3    16    17    18    19    20
4    21    22    23    24    25
5    26    27    28    29    30
6    31    32    33    34    35
7    36    37    38    39    40
8    41    42    43    44    45
9    46    47    48    49    50

In [39]:
# accessing elements from dataframe

df1['A']  # accessing single column

KeyError: 'A'

In [41]:
df1[['col1','col2']] # accessing multiple columns

   col1  col2
0     1     2
1     4     5
2     7     8
3    10    11

In [23]:
# indexing in pandas

# accessing individual elements in indexing


# slicing in pandas
# accessing range of elements is slicing

In [24]:
df1

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

# indexing
 accessing individual elements using loc and iloc

### indexing using loc
 loc means location... we can indexx elements using label based indexing

obj.loc[]

In [26]:
df1.loc[1, 'A']

np.int64(4)

In [30]:
df1.loc[3, 'C']

np.int64(12)

### iloc
iloc: integer based location
- obj.iloc(row_index, col_index)

In [31]:
df1.iloc[2,1]

np.int64(8)

In [33]:
df1.iloc[-1,-1]

np.int64(12)

### Slicing in pandas
- using loc
- obj.loc[row_level_slicing, col_level_slicing]

In [42]:
df1.loc[0:1, :'col2']

   col1  col2
0     1     2
1     4     5

In [43]:
df1.loc[:1, :'col2']

   col1  col2
0     1     2
1     4     5

### slicing using iloc
- obj.iloc[row_level_slicing, col_level_slicing]

In [48]:
df1.iloc[:2, -2:]

   col4  col5
0     4     5
1     9    10

In [49]:
print(df1.shape)

(10, 5)

In [50]:
print(df1.size)
print(df1.ndim)

50
2

In [51]:
print(df1.sample(3))

   col1  col2  col3  col4  col5
5    26    27    28    29    30
4    21    22    23    24    25
0     1     2     3     4     5

In [53]:
df1['col1'].dtype

dtype('int64')

In [54]:
df1.describe()

            col1       col2       col3       col4       col5
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   23.500000  24.500000  25.500000  26.500000  27.500000
std    15.138252  15.138252  15.138252  15.138252  15.138252
min     1.000000   2.000000   3.000000   4.000000   5.000000
25%    12.250000  13.250000  14.250000  15.250000  16.250000
50%    23.500000  24.500000  25.500000  26.500000  27.500000
75%    34.750000  35.750000  36.750000  37.750000  38.750000
max    46.000000  47.000000  48.000000  49.000000  50.000000